from selenium import webdriver
from selenium.webdriver.support.select import Select
import time

def 创建工作日志(l):
    dr = webdriver.Firefox()

    dr.get("https://jira-team.smzdm.com/issues/?jql=project%20%3D%20WORKLOG%20AND%20resolution%20%3D%20Unresolved%20AND%20reporter%20in%20(currentUser())%20ORDER%20BY%20summary%20DESC%2C%20priority%20DESC%2C%20updated%20DESC")
    dr.find_element_by_xpath('//*[@id="username"]').send_keys("chencheng01")
    dr.find_element_by_xpath('//*[@id="password"]').send_keys("cD05180629")
    dr.find_element_by_xpath('/html/body/div[1]/div/div[1]/div/form[1]/section[3]/input[4]').click()
    time.sleep(2)


    for i in l:
        dr.get(
            "https://jira-team.smzdm.com/issues/?jql=project%20%3D%20WORKLOG%20AND%20resolution%20%3D%20Unresolved%20AND%20reporter%20in%20(currentUser())%20ORDER%20BY%20summary%20DESC%2C%20priority%20DESC%2C%20updated%20DESC")
        time.sleep(3)
        dr.find_element_by_xpath('//*[@id="create_link"]').click()
        time.sleep(2)
        dr.find_element_by_xpath('//*[@id="summary"]').send_keys("陈程-{}-{}".format(i[0],i[1]))
        s1 = Select(dr.find_element_by_id('customfield_10308'))
        s1.select_by_visible_text("推荐")
        dr.switch_to.frame("mce_0_ifr")
        dr.find_element_by_xpath('//*[@id="tinymce"]').send_keys(i[1])
        dr.switch_to.default_content()
        dr.find_element_by_xpath('//*[@id="customfield_10422"]').send_keys(i[0][0:4]+"-"+i[0][4:6]+"-"+i[0][6:8])
        dr.find_element_by_xpath('//*[@id="timetracking_originalestimate"]').send_keys(i[2])
        dr.find_element_by_xpath('//*[@id="timetracking_remainingestimate"]').send_keys(i[2])
        dr.find_element_by_xpath('//*[@id="create-issue-submit"]').click()
        time.sleep(3)

if __name__ == '__main__':
    l=[
        # ['20190102', '安卓9.3.5', '9.2h'],
        # ['20190103', '推荐3.7.7测试', '8.5h'],
        # ['20190104', '推荐3.7.7测试', '9.4h'],
        # ['20190107', '推荐3.7.7测试', '8.7h'],
        # ['20190108', '推荐3.7.7', '8.4h'],
        # ['20190109', '推荐3.7.8', '8.8h'],
        # ['20190110', '推荐3.7.8测试', '8.7h'],
        # ['20190111', '推荐3.7.8', '8.7h'],
        # ['20190114', '推荐3.7.8', '10.8h'],
        # ['20190115', '推荐3.7.8', '9.2h'],
        # ['20190116', '推荐3.7.8', '9.3h'],
        # ['20190117', 'APP', '9.0h'],
        # ['20190118', 'APP', '9.1h'],
        # ['20190121', '推荐3.7.8', '8.1h'],
        # ['20190122', 'APP', '8.4h'],
        # ['20190123', 'APP', '8.7h'],
        # ['20190124', 'AI2.0.0测试', '11.2h'],
        # ['20190125', '推荐3.7.8', '8.9h'],
        # ['20190128', '推荐3.7.9用例编写', '8.1h'],
        # ['20190129', '推荐3.7.9', '11.3h'],
        # ['20190130', '推荐3.7.9', '8.2h'],
        # ['20190131', '推荐3.7.9', '8.2h'],
        # ['20190201', '推荐3.7.9测试', '8.0h'],
        # ['20190202', '调休一天', '8.0h'],
        # ['20190203', '调休一天', '8.0h'],
        # ['20190211', 'app9.3.15测试', '8.1h'],
        # ['20190212', 'AI2.0.0', '8.7h'],
        # ['20190213', 'app9.3.15测试', '8.4h'],
        # ['20190214', '推荐3.7.9', '8.1h'],
        # ['20190215', '推荐3.7.9测试', '8.1h'],
        # ['20190216', '客户端自动化环境配置', '4.0h'],
        # ['20190217', 'APP9.3.15SDK测试', '4.0h'],
        # ['20190218', '推荐3.7.9.1', '8.6h'],
        # ['20190219', 'app9.3.15测试', '8.7h'],
        # ['20190220', 'app9.3.15测试', '8.6h'],
        # ['20190221', 'app9.3.15', '9.2h'],
        # ['20190222', '推荐3.7.10', '8.2h'],
        # ['20190223', '推荐3.7.10', '9.0h'],
        # ['20190225', 'APP9.3.20', '8.1h'],
        # ['20190226', '测试用例编写', '8.2h'],
        # ['20190227', '测试用例评审、修改、导入', '8.5h'],
        # ['20190228', '推荐曝光测试', '8.8h'],
        # ['20190301', '测试用例编写', '8.6h'],
        # ['20190302', 'PC千人千面验证', '8.6h'],
        # ['20190304', 'PC千人千面验证', '8.9h'],
        # ['20190305', 'PC千人千面230', '8.3h'],
        # ['20190306', 'APP', '8.6h'],
        # ['20190307', 'APP9.3.20测试', '8.7h'],
        # ['20190308', 'APP9.3.20', '12.7h'],
        # ['20190311', 'APP9.3.20', '6.4h'],
        # ['20190311', '调休2h', '2.0h'],
        # ['20190312', 'APP9320', '9.8h'],
        # ['20190313', 'APP9320', '8.6h'],
        # ['20190314', 'APP9320', '8.4h'],
        # ['20190314', 'TUI3.9', '4.0h'],
        # ['20190315', '测试用例编写', '11.0h'],
        # ['20190317', 'APP9325', '4.6h'],
        # ['20190318', 'TUI3.9', '8.1h'],
        # ['20190319', 'TUI3.9', '8.9h'],
        # ['20190320', '调休半天', '4.0h'],
        # ['20190321', 'APP9.3.25', '8.1h'],
        # ['20190322', 'APP', '4.0h'],
        # ['20190322', '调休半天', '4.0h'],
        # ['20190325', '推荐931用例编写', '8.6h'],
        # ['20190326', 'APP9.3.25 230环境测试', '5h'],
        # ['20190326', '推荐931用例编写', '3.7h'],
        ['20190328', '推荐392需求评审', '1.3h'],
        ['20190328', '回归用例梳理', '1.6h'],
        ['20190328', '推荐391测试', '5.6h'],
        ['20190329', '我的足迹线上抽检', '1.5h'],
        ['20190329', '推荐391测试', '3.5h'],
        ['20190329', '发版跟进', '5.2h'],
        ['20190401', 'ab分流BUGfix', '3h'],
        ['20190401', '推荐391测试', '5.5h'],
        ['20190402', '模型测试', '1h'],
        ['20190402', '推荐391测试', '9.6h'],
        ['20190403', '不感兴趣BUGfix', '3h'],
        ['20190403', '推荐391测试', '5.4h'],
        ['20190404', '推荐391测试', '8.3h'],

    ]
    创建工作日志(l)



