WORK_DAY = [
    "20190202", "20190203",  # 2019春节调班
    "20190428", "20190505",  # 2019五一调班
    "20190929", "20191012",  # 2019国庆调班
    "20200119", "20200201",  # 2020春节调班
    "20200426", "20200509",  # 2020五一调班
    "20200628",  # 2020端午调班
    "20200927", "20201010"  # 2020十一调班
]
FREE_DAY = [
    "20190101",  # 2019元旦假期
    "20190204", "20190205", "20190206", "20190207", "20190208",  # 2019春节假期
    "20190405",  # "2019清明假期
    "20190501", "20190502", "20190503",  # 2019五一假期
    "20190607",  # 2019端午假期
    "20190913",  # 2019中秋假期
    "20191001", "20191002", "20191003", "20191004", "20191007",  # 2019国庆假期
    "20200101",  # 2020元旦假期
    "20200124", "20200127", "20200128", "20200129", "20200130",  # 2020春节假期
    "20200406",  # "2020清明假期
    "20200501", "20200504", "20200505",  # 2020五一假期
    "20200625", "20200626",  # 2020端午假期
    "20201001",  # 2020中秋假期
    "20201002", "20201005", "20201006", "20201007", "20201008",  # 2020国庆假期
]
YMC = ["十一", "十二", "正", "二", "三", "四", "五", "六", "七", "八", "九", "十"]
RMC = ["初一", "初二", "初三", "初四", "初五", "初六", "初七", "初八", "初九", "初十",
       "十一", "十二", "十三", "十四", "十五", "十六", "十七", "十八", "十九", "二十",
       "廿一", "廿二", "廿三", "廿四", "廿五", "廿六", "廿七", "廿八", "廿九", "三十", "卅一"]

NAME_MAP = {"chencheng01": {"nick_name": ["陈程", "大橙子", "程程", "程帅", "组长"]},
            "chenxupeng": {"nick_name": ["陈旭鹏", "鹏鹏", "帅鹏", "靓鹏"]},
            "zhangfan": {"nick_name": ["樊樊", "张樊", "大镁铝", ]},
            "liuhong": {"nick_name": ["红红", "刘红", "boss", ]},
            "huxue": {"nick_name": ["胡雪", "小雪", "❄️", ]},
            "zhaoyonghui": {"nick_name": ["赵勇辉", "小辉辉", "辉哥哥️", ]}, }
ENCOURAGE_LIST = [
    "继续加油哦",
    "送你一朵小🌺",
    "敬佩努力的你",
    "666",
    "棒棒哒💯",
]
ROBOT_URL = "https://oapi.dingtalk.com/robot/send?access_token=de38fbbe5b18ce3830687d85d" \
            "4d6d71e6aaacf02353b9eb385f43e178f5f95a1"
